cask_args appdir: "/Applications"

tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "caskroom/versions"
tap "caskroom/cask"
tap "coteditor/coteditor"
tap "moncho/dry"

brew "cloc" # ソースコードの行数など統計情報を調べるツール
brew "curl" # HTTPリクエストを送信するツール
brew "direnv" # 開発プロジェクトごとに環境変数を自動セットできるようにするツール
brew "exa" # もっといいls
brew "fd" # もっといいfin
brew "git"
brew "git-lfs"
brew "git-now" # git commitを一番カジュアルにできるツール
brew "go"
brew "hostess" # /etc/hostsを管理するツール
brew "httpie"
brew "hub"
brew "jq"
brew "micro" # コミットメッセージをちょちょっと書くのに便利なエディタ
brew "node"
cask "ngrok" # localhostを一時的に外部から見られるウェブページにするツール
brew "nkf" # 文字コード変換
brew "nmap" # ポートスキャナ
brew "optipng" # png画像の容量減らすツール
brew "q" # CSVに対してSQLを投げれる魔法のようなツール
brew "reattach-to-user-namespace"
brew "sshrc" # どのサーバでも同じ.bashrcを使えるようにするSSHクライアント
brew "stone" # TCPリピータ
brew "the_silver_searcher" # もっといいgrep
brew "tig"
brew "tmux"
brew "tree"
brew "unar" # なんでも解凍ツール
brew "vim"
brew "vimpager"
brew "watchman"
brew "wget"
brew "yarn"
brew "zplug"
brew "zsh"
brew "coteditor/coteditor/cot"
brew "homebrew/php/composer"
brew "moncho/dry/dry" # Docker管理ツール

cask "atom"
cask "alfred"
cask "bartender"
cask "bitbar"
cask "boostnote"
cask "coderunner"
cask "daisydisk"
cask "docker"
cask "expandrive"
cask "fantastical"
cask "firefox"
cask "google-chrome"
cask "google-japanese-ime"
cask "google-drive-file-stream"
cask "hammerspoon"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kaleidoscope"
cask "macdown"
cask "macs-fan-control"
cask "nanowallet"
cask "libreoffice"
cask "postico"
cask "quitter"
cask "sequel-pro"
cask "setapp"
cask "skype"
cask "staruml"
cask "sync"
cask "teamviewer"
cask "typora"
cask "tunnelblick"

mas "1Password", id: 443987910
# mas "Affinity Designer", id: 824171161
mas "BatteryHero", id: 782015477
mas "CotEditor", id: 1024640650
mas "Day One", id: 1055511498
mas "Dropshelf", id: 540404405
mas "Evernote", id: 406056744
mas "Flexiglass", id: 426410278
mas "ForkLift", id: 412448059
mas "GIF Brewery 3", id: 1081413713
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "MindNode", id: 992076693
mas "Monosnap", id: 540348655
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Reeder", id: 880001334
mas "Screens", id: 446107677
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "The Clock", id: 488764545
mas "The Unarchiver", id: 425424353
mas "Tree 2", id: 944654199
mas "Unclutter", id: 577085396
mas "WinArchiver Lite", id: 414855915
